package Map;

public class map {

    public static void main(String[] args) {
        String map =
                        "+-----+-----+------+-----+-----+-----+---+-----+-----+-----+\n" +
                        "|  1  |  2  |  3   |  4  |  5  |  6  | 7 |  8  |  9  | 10  |\n" +
                        "| 출발 | 서울 | 인천 | 대전 | 전주 |동두천|홍천|영종도| 남원 |무인도|\n" +
                        "+-----+-----+-----+------+-----+-----+---+-----+-----+-----+\n" +
                        "|  24 |                                              | 11  |\n" +
                        "| 파주 |                                              |울릉도|\n" +
                        "+-----+                                              +-----+\n" +
                        "|  23 |                                              | 12  |\n" +
                        "| 춘천 |                                              |의정부|\n" +
                        "+-----+-----+-----+-----+-----+-----+-----+-----+----+-----+\n" +
                        "|  22 | 21  | 20  | 19  | 18  | 17  | 16  | 15  | 14 | 13  |\n" +
                        "| 강릉 |강화도| 부산 |남양주| 양양 |제주도| 남해 |영주시|횡성 |한번더|\n" +
                        "+-----+-----+-----+-----+-----+-----+-----+-----+----+-----+\n";

        // 맵 출력
        System.out.println(map);
//            for (String line : map) {
//                System.out.println(line);
//            }
    }

}


